In [1]:
#<> <= >= ==

In [4]:
a=10
print(a==5)

False

In [5]:
a=10
print(a !=5)

True

In [8]:
#if <condition>:
#    <operations>
#elif <condition>:
 #   <operations>
#else 
  #  <operations>

In [21]:
x=int(input("Enter x="))
if x>0:
    print("The no is +ve")
elif x==0:
    print("The number is neutral")
else:
    print("The number is -ve")

Enter x=0
The number is neutral

In [19]:
x=int(input("Enter x="))
if x%2==0:
    print("The no is even")
else:
    print("the no is odd")

Enter x=5
the no is odd

In [23]:
a=int(input("Enter a="))
b=int(input("Enter b="))
if a>b:
    print("a is greater than b")
elif b>a:
    print("b is greater than a")
else:
    print("a and b are equal")

Enter a=3
Enter b=4
b is greater than a

In [5]:
a=int(input("enter a="))
b=int(input("enter b="))
o=input("enter +or - or * or/ ")
if o== "+":
    print(a+b)
elif o== "-":
    print(a-b)
elif o== "*":
    print(a*b)
elif o=="/" :
    if b!=0:
        print(a/b)
else:
    print("the value of b cannot be zero")

enter a=4
enter b=0
enter +or - or * or/ /

In [2]:
physics=int(input("enter physics marks="))
chemistry=int(input("enter chemistry marks ="))
math=int(input("enter math marks ="))
english=int(input("enter english marks ="))
nepali=int(input("enter nepali marks ="))

if physics>=32 and chemistry>=32 and math>=32 and english>=32 and nepali>=32:
    total=physics+chemistry+math+english+nepali
    per=total/5
 
    if physics>=32:
        print("pass in physics")
    else:
        print("fail in physics")

    if per>= 80: 
        grade="A"
    elif per>=60 :
        grade="B"
    elif per>=45:
        grade="C"
    else:
        grade="D"
    
    print("Total =",total)
    print("Per=",per)
    print("Grade=",grade)

else:
    print("Grade=F")

enter physics marks=45
enter chemistry marks =45
enter math marks =45
enter english marks =45
enter nepali marks =45
pass in physics
Total = 225
Per= 45.0
Grade= C

#### logical operators 
#and &
print(True and False)
print(False and True)
print(True and True)
print(False and False)

In [5]:
#or
print(True or False)
print(False or True)
print(False or False)
print(True or True)

True
True
False
True

In [14]:
x=int(input("enter x="))
if x>0 and x%2==0:
    print("the value of x is positive and even")
elif x>0 and x%2!=0:
    print("the value of x is negative and odd")
elif x<0 and x%2==0:
     print("the value of x is negative and even")
else:
    print("the value of x is negatvie and odd")

enter x=-1
the value of x is negatvie and odd

In [15]:
#nested if/else

#if<condition>:
 #   <operations>
  #  else:
   #     <operations>
#else:
 #   if<condition>:
   # <operations>
    #else:
     #   <operations>

In [1]:
x=int(input("enter x="))
if x>=0:
    if x%2==0:
        print("the value of x is positive and even")
    else:
          print("the value of x is positive and odd")
else:
    if x%2==0:
        print("the value of x is negative and even")
             
        
    else:
             print("the value of x is negative and odd")

enter x=4
the value of x is positive and even

In [ ]:
#for loop
#while loop

In [1]:
#for loop
#range(5)    #0,1,2,3,4   for(i=0;i<5;i++;)
#range(1,5)  #1,2,3,4     for(i=1;i<5;i++;)
#range(1,10,2) #1,3,5,7,9  for(i=1,i<10; i=i+2;)

In [3]:
for i in range(5):
    print(i,"Hello Subheksha")

0 Hello Subheksha
1 Hello Subheksha
2 Hello Subheksha
3 Hello Subheksha
4 Hello Subheksha

In [4]:
for i in range(1,5):
    print(i,"Hello Subheksha")

1 Hello Subheksha
2 Hello Subheksha
3 Hello Subheksha
4 Hello Subheksha

In [7]:
for i in range(5,0,-1):
    print(i,"Hello Subheksha")

5 Hello Subheksha
4 Hello Subheksha
3 Hello Subheksha
2 Hello Subheksha
1 Hello Subheksha

In [8]:
for i in range(5,-1,-1):
    print(i,"Hello World")

5 Hello World
4 Hello World
3 Hello World
2 Hello World
1 Hello World
0 Hello World

In [10]:
#WAP to create a multiplication table
n=int(input("enter n="))
for i in range(1,11):
    print(n,"*",i,"=",n*i)

enter n=6
6 * 1 = 6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54
6 * 10 = 60

In [11]:
for i in range(5):
    x=int(input("enter x="))
    print("You entered",x)

enter x=5
You entered 5
enter x=7
You entered 7
enter x=0
You entered 0
enter x=7
You entered 7
enter x=8
You entered 8

In [6]:
#s=str()
s=""
n=int(input("enter n="))
for i in range(n):
    x=input("enter x=")
    s=s+x+"\n"
    
print(s)

enter n=3
enter x=uhediu
enter x=edjiwej
enter x=ejdiw
uhediu
edjiwej
ejdiw

In [11]:
s=""
n=int(input("enter n="))
for i in range(n):
    name=input("enter name=")
    phone=input("enter phone number=")
    s=s+name+ " "+phone +"\n"
    
print(s)

enter n=2
enter name=ram
enter phone number=4756747389
enter name=ganesh
enter phone number=874863
ram 4756747389
ganesh 874863

In [1]:
#while loop

In [2]:
#while<condition>:
# <operations>

In [3]:
a=0
while a<=5:
    print(a)
    a=a+1

0
1
2
3
4
5

In [5]:
a=0
while a<5:
    print(a,"hello world")
    #a=a+1
    a+=1

0 hello world
1 hello world
2 hello world
3 hello world
4 hello world

In [1]:
#WAP to create a multiplication table
i=1
n=int(input("enter n="))
while i<=10:
    print(n*i)
    i=i+1

enter n=5
5
10
15
20
25
30
35
40
45
50

In [2]:
i=0
s=0
n=int(input("enter n="))
while i<n:
    x=int(input("enter x="))
    s=s+x
    i=i+1
    print("sum=",s)

enter n=5
enter x=4
sum= 4
enter x=67
sum= 71
enter x=87
sum= 158
enter x=2
sum= 160
enter x=67
sum= 227

In [1]:
#5!=1*2*3*4*5
i=1
fac=1
n=int(input("enter n="))
while i<=n:
    fac=fac*i
    i=i+1
    print(fac)

enter n=5
1
2
6
24
120

In [3]:
s=""
i=0
n=int(input("enter n="))
while i<n:
    name=input("enter name=")
    phone=input("enter phone number=")
    s=s+name+ " "+phone +"\n"
    i=i+1
    
print(s)

enter n=4
enter name=gfl
enter phone number=hfzfg
enter name=rtytui
enter phone number=87746
enter name=gtfy
enter phone number=3456789
enter name=lkjhgfd
enter phone number=987654
gfl hfzfg
rtytui 87746
gtfy 3456789
lkjhgfd 987654

In [2]:
#control statement in while loop
i=0
while i<10:
    if i==5:
        break
    print(i)
    i=i+1

0
1
2
3
4

In [1]:
#control statement in while loop
i=0
while i<10:
    if i==5:
        i=i+1
        continue
    print(i)
    i=i+1

0
1
2
3
4
6
7
8
9

In [2]:
#WAP to find if the given number is prime or composite.
#prime ->2,3,5,7,11,13,17,19
#composite -> 4,6,8,9,10,12


number=int(input("enter a number="))
if number >1:
    for i in range(2,int(number ** 0.5)+1):
        if number % i==0:
            print(number,"is a composite number")
            print(number,"is not a prime number")
            break
        else:
            print("is a prime number",number)
    else:
        print("is not a prime number",number)

enter a number=5
is a prime number 5
is not a prime number 5

In [1]:
for i in range(1,5):
    print(i,"hello world")

1 hello world
2 hello world
3 hello world
4 hello world

In [2]:
for i in range(5,-1,-1):
    print(i,"hello world")

5 hello world
4 hello world
3 hello world
2 hello world
1 hello world
0 hello world

In [6]:
for i in range(1,10,2):
    print(i,"hello world")

1 hello world
3 hello world
5 hello world
7 hello world
9 hello world

In [7]:
x=int(input("enter x="))
if x>0:
    print("the no is +ve")
else:
    print("the no is -ve")

enter x=-2
the no is -ve

In [2]:
a=int(input("enter a="))
b=int(input("enter b="))
o=input("enter + or - or * or /")
if o== "+":
    print(a+b)
elif o=="-":
    print(a-b)
elif o=="*":
    print(a*b)
elif o=="/":
    print(a/b)
else:
    print("the result is invalid")

enter a=4
enter b=3
enter + or - or * or /%
the result is invalid

In [3]:
physics=int(input("enter physics marks="))
chemistry=int(input("enter chemistry marks="))
maths=int(input("enter maths marks="))
english=int(input("enter english marks="))
nepali=int(input("enter nepali marks="))

total=physics+chemistry+maths+english+nepali
per=total/5

if per >=80:
    grade="A"
elif per >=60:
    grade="B"
elif per >=45:
    grade="C"
else:
    grade="F"
    
print("Total=",total)
print("per=",per)
print("grade=",grade)

enter physics marks=45
enter chemistry marks=56
enter maths marks=76
enter english marks=6
enter nepali marks=5
Total= 188
per= 37.6
grade= F

In [3]:
a="hello"
b="world"
c=a+b
print(c)

helloworld

In [5]:
a="hello world\n"
print(a*2)

hello world
hello world

In [10]:
a="hello world"
print(a[0:5])
print(a[0:10:2])

hello
hlowr

In [13]:
a="hello world"
for i in range (len(a)):
    print(a[i],end="")

hello world

In [15]:
i=0
a="hello world"
while i<len(a):
    print(a[i],end="")
    i=i+1

hello world

In [17]:
#string formatting
name="Ram"
age=67
add="kathmandu"

info="hello world I am "+ name + " I am from " + add + " I am " + str(age)
print(info)

hello world I am Ram I am from kathmandu I am 67

In [22]:
name="Ram"
age=67
add="kathmandu"

info=f"Hello world I am {name}. I am from {add}. I am {age}."
print(info)

Hello world I am Ram. I am from kathmandu. I am 67.

In [25]:
s=""
i=0
n=int(input("enter n="))
while i<n:
      name=input("enter name=")
      phone=input("enter name=")
      s=s+f"{name},{phone}"
      i=i+1
      print(s)

enter n=1
enter name=jhjekg
enter name=987654
jhjekg,987654

In [28]:
#search in string 
a= "Ram Shyam Hari Sita Gita Nabin"
search=input("enter search value=")
if search in a:
    print("yes")
else:
    print("NO")

enter search value=Ram
yes

In [29]:
a= "Ram Shyam Hari Sita Gita Nabin"
print(a.upper())
print(a.lower())
print(a)

RAM SHYAM HARI SITA GITA NABIN
ram shyam hari sita gita nabin
Ram Shyam Hari Sita Gita Nabin

In [33]:
a= "Ram Shyam Hari Sita Gita Nabin Nabina".lower()
search=input("enter search value=").lower()
if search in a:
    print("yes")
    print(a.count(search))
else:
    print("NO")

enter search value=nabin
yes
2

In [38]:
#replace()
a= "Ram Shyam Hari Sita Gita Nabin Nabina"
a=a.replace('Nabina','sabina')
print(a)

Ram Shyam Hari Sita Gita Nabin sabina

SyntaxError: unmatched ']' (1057312418.py, line 1)

In [40]:
a= "Ram Shyam Hari Sita Gita Nabin Nabina"
a.split()

['Ram', 'Shyam', 'Hari', 'Sita', 'Gita', 'Nabin', 'Nabina']

In [5]:
#python data collection
#list
#tuple
#dict
#set

In [6]:
#list
#-indexing
#-multiple and duplicate data
#-ordered
#-mutable

In [7]:
#l=list()
l=["Apple","Ball","Cat","Dog","Fish"]
a=[1,2,3,4,5,6,7,8,9,0]
print(type(l))
print(type(a))

<class 'list'>
<class 'list'>

In [14]:
l=["Apple","Ball","Cat","Dog","Fish"]
print(l)
print(l[0])
print(l[0:4])
print(l[0:10:2])

['Apple', 'Ball', 'Cat', 'Dog', 'Fish']
Apple
['Apple', 'Ball', 'Cat', 'Dog']
['Apple', 'Cat', 'Fish']

In [15]:
a=[1,2,3,4]
b=[5,6,7,8,9]
c=a+b
print(c)

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [16]:
a=[1,2,3,4]
print(a*2)

[1, 2, 3, 4, 1, 2, 3, 4]

In [17]:
l=["Apple","Ball","Cat","Dog","Fish"]
for i in l:
    print(i)

Apple
Ball
Cat
Dog
Fish

In [1]:
l=["Apple","Ball","Cat","Dog","Fish","apple"]
search=input("enter search=")
if search in l:
    print("YES")
    print(l.count(search))
else:
    print("N0")

enter search=Apple
YES
1

In [2]:
#append() extend() insert()

In [5]:
a=["hello"]
a.append("ball")
a.append("cat")
a.append("shark")
print(a)

['hello', 'ball', 'cat', 'shark']

In [8]:
l=[]
n=int(input("enter n="))
for i in range(n):
    x=int(input("enter x="))
    l.append(x)
    
print(l)

enter n=4
enter x=3
enter x=3
enter x=3
enter x=3
[3, 3, 3, 3]

In [14]:
l=[13,23,45,5,6]
print("maximum value=",max(l))
print("minimum value=",min(l))
print("sum of list=",sum(l))
l.sort()
print(l)
l.sort(reverse=True)
print(l)

maximum value= 45
minimum value= 5
sum of list= 92
[5, 6, 13, 23, 45]
[45, 23, 13, 6, 5]

In [15]:
a=["ball","zebra","monkey","cat"]
a.sort()
print(a)

['ball', 'cat', 'monkey', 'zebra']

In [18]:
a=["ball","zebra","monkey","cat"]
a.insert(4,"zebra")
print(a)

['ball', 'zebra', 'monkey', 'cat', 'zebra']

In [23]:
a=[1,2,3,4]
b=[6,7,8,9,0]
a.extend(b)
print(a)

[1, 2, 3, 4, 6, 7, 8, 9, 0]

In [24]:
#del remove() pop()

In [26]:
a=["ball","zebra","monkey","cat"]
del a[0:3]
print(a)

['cat']

In [33]:
a=["ball","zebra","monkey","cat","ball","ball"]
c=a.count("ball")
for i in range(c):
    a.remove("ball")
print(a)

['zebra', 'monkey', 'cat']

In [35]:
a=["ball","zebra","monkey","cat","ball","ball"]
c=len(a)
for i in range(c):
    if"ball"==a[i]:
        print(i)

0
4
5

In [1]:
#list inside list

In [3]:
a=[[1,2,3],
   [4,5,6],
   [8,9,0]]
print(a)

[[1, 2, 3], [4, 5, 6], [8, 9, 0]]

In [4]:
a=[['Ram',45,'kathmandu'],
   ['shyam',67,'lalitpur']]
print(a)

[['Ram', 45, 'kathmandu'], ['shyam', 67, 'lalitpur']]

In [5]:
print(a[0])

['Ram', 45, 'kathmandu']

In [8]:
print(a[1][2])

lalitpur

In [1]:
l=[]
n=int(input("enter n="))
for i in range(n):
    name=input("enter name=")
    age=int(input("enter age="))
    add=input("enter add=")
    x=[name,age,add]
    l.append(x)
print(l)

enter n=1
enter name=edef
enter age=45
enter add=rgttr
[['edef', 45, 'rgttr']]

In [3]:
l=["ball","zebra","monkey","cat","ball","ball"]
l.append("strawbweey")
l

['ball', 'zebra', 'monkey', 'cat', 'ball', 'ball', 'strawbweey']

In [8]:
#search
l=[['Ram',34,'kathmandu'],
   ['Bharat',43,'lalitpur'],
   ['Ramu',56,'bhaktapur']]

   
name=input("enter name=")
for i in l:
    if name in i:
        print(i)

enter name=Ram
['Ram', 34, 'kathmandu']

In [6]:
l=["Ram",34,"kathmandu"]
l[0]="Rama"
print(l)

['Rama', 34, 'kathmandu']

In [9]:
l=[['Ram',34,'kathmandu'],
   ['Bharat',43,'lalitpur'],
   ['Ramu',56,'bhaktapur']]
l[0][0]="Rama"
l

[['Rama', 34, 'kathmandu'],
 ['Bharat', 43, 'lalitpur'],
 ['Ramu', 56, 'bhaktapur']]

In [14]:
#WAP to create a matrix by taking input from user.
#r ->?
#c ->?
#x ->? x=[[1,2,3]]
#y ->?[1,2,3]

x=[]
r=int(input("enter r="))
c=int(input("enter c="))
for i in range(r):
    y=[]
    for j in range(c):
        z=int(input("enter the value of z="))
        y.append(z)
    x.append(y)
print(x)

enter r=3
enter c=3
enter the value of z=34
enter the value of z=43
enter the value of z=45
enter the value of z=65
enter the value of z=78
enter the value of z=87
enter the value of z=78
enter the value of z=79
enter the value of z=57
[[34, 43, 45], [65, 78, 87], [78, 79, 57]]

In [1]:
#dictionary
#-Indexing
#-Ordered
#-multiple and duplicate data
#-mutable
#d={<key>:<value>,<key>:<value>,....}

In [5]:
d={'a':'apple','b':'ball','c':'cat'}
print(d)
print(type(d))

{'a': 'apple', 'b': 'ball', 'c': 'cat'}
<class 'dict'>

In [4]:
print(d['a'])

apple

In [8]:
d={'a':'apple','b':'ball','c':'cat','c':'cat'}
d

{'a': 'apple', 'b': 'ball', 'c': 'cat'}

In [11]:
a={'a':'apple','b':'ball','c':'cat'}
b={1:1,2:4,3:9}
a.update(b)
print(a)

{'a': 'apple', 'b': 'ball', 'c': 'cat', 1: 1, 2: 4, 3: 9}

In [15]:
a={'a':'apple','b':'ball','c':'cat'}
for i in a:
    print(i,end=" ")

a b c

In [16]:
a={'a':'apple','b':'ball','c':'cat'}
for i in a.values():
    print(i,end=" ")

apple ball cat

In [17]:
a={'a':'apple','b':'ball','c':'cat'}
for i in a.items():
    print(i,end=" ")

('a', 'apple') ('b', 'ball') ('c', 'cat')

In [18]:
#create 
#d=dict()
d={}
d['a']="APPLE"
d['b']="BALL"
d['c']="CAT"
d

{'a': 'APPLE', 'b': 'BALL', 'c': 'CAT'}

In [19]:
d={'a':'apple','b':'ball','c':'cat'}
d['a']="Ant"
d

{'a': 'Ant', 'b': 'ball', 'c': 'cat'}

In [20]:
#del pop
d={'a':'apple','b':'ball','c':'cat'}
del d['a']
print(d)

{'b': 'ball', 'c': 'cat'}

In [21]:
d={'a':'apple','b':'ball','c':'cat'}
b=d.pop('a')
print(b)
print(d)

apple
{'b': 'ball', 'c': 'cat'}

In [22]:
d={'a':'apple','b':'ball','c':'cat'}
d.pop('a')
d

{'b': 'ball', 'c': 'cat'}

In [23]:
#list inside dict
info={'ram':1234,'shyam':3435,'hari':343534}
info

{'ram': 1234, 'shyam': 3435, 'hari': 343534}

In [26]:
#list inside dict
info={'ram':[7365734,74587378],
      'shyam':[847845,48934],
      'hari':[94864,489485]}
info

{'ram': [7365734, 74587378], 'shyam': [847845, 48934], 'hari': [94864, 489485]}

In [30]:
print(info['ram'])
print(info['ram'][1])

[7365734, 74587378]
74587378

In [31]:
info['ram'][0]=9863329863
info

{'ram': [9863329863, 74587378],
 'shyam': [847845, 48934],
 'hari': [94864, 489485]}

In [2]:

d={}
n=int(input("enter key value="))
for i in range(n):
    name=input("enter name=")
    ntc=input("enter ntc no=")
    ncell=input("enter ncell no=")
    d[name]=[ntc,ncell]
    
d

enter key value=2
enter name=ram
enter ntc no=9863329863
enter ncell no=9676653568
enter name=shyam
enter ntc no=98745789896
enter ncell no=9777766679

{'ram': ['9863329863', '9676653568'], 'shyam': ['98745789896', '9777766679']}

In [7]:
d={'name':['ram','shyam'],
   'ntc':[9845784,9876568],
   'ncell':[9845854,958745]}
print(d['name'][0],d['ntc'][0],d['ncell'][0])

ram 9845784 9845854

In [1]:
d={'name':[],
   'ntc':[],
   'ncell':[]}

n=int(input("enter n="))
for i in range(n):
    name=input("enter name=")
    ntc=input("enter ntc no=")
    ncell=input("enter ncell no=")
    d['name'].append(name)
    d['ntc'].append(ntc)
    d['ncell'].append(ncell)    
    
print(d)

enter n=2
enter name=ram
enter ntc no=98343647
enter ncell no=87382398
enter name=hari
enter ntc no=9387242
enter ncell no=48789642
{'name': ['ram', 'hari'], 'ntc': ['98343647', '9387242'], 'ncell': ['87382398', '48789642']}

In [2]:
#dict inside list
d=[{'name':'ram','age':56,'add':'kathmandu'},
   {'name':'ramu','age':96,'add':'lalitpur'},
   {'name':'shyam','age':50,'add':'bhaktapur'},
   {'name':'red','age':56,'add':'kathmandu'}]
print(d)

[{'name': 'ram', 'age': 56, 'add': 'kathmandu'}, {'name': 'ramu', 'age': 96, 'add': 'lalitpur'}, {'name': 'shyam', 'age': 50, 'add': 'bhaktapur'}, {'name': 'red', 'age': 56, 'add': 'kathmandu'}]

In [7]:
print(d[0]['name'])

ram

In [11]:
l=[]
n=int(input("enter n="))
for i in range(n):
    name=input("enter name=")
    ntc=input("enter ntc no=")
    ncell=input("enter ncell no=")
    d={'name':name,'ntc':ntc,'ncell':ncell}  
    l.append(d)
    
print(l)

enter n=1
enter name=jhgfx
enter ntc no=87656789
enter ncell no=987654321
[{'name': 'jhgfx', 'ntc': '87656789', 'ncell': '987654321'}]

[{'name': 'iuhyj', 'ntc': '878509876', 'ncell': '98765'}]

In [13]:
l[0]

{'name': 'jhgfx', 'ntc': '87656789', 'ncell': '987654321'}

In [29]:
del l[0]
l

IndexError: list assignment index out of range

In [18]:
#dict inside dict
info={1:{'name':'ramu','age':96,'add':'lalitpur'},
      2: {'name':'shyam','age':50,'add':'bhaktapur'},
      3:{'name':'red','age':56,'add':'kathmandu'}}
info

{1: {'name': 'ramu', 'age': 96, 'add': 'lalitpur'},
 2: {'name': 'shyam', 'age': 50, 'add': 'bhaktapur'},
 3: {'name': 'red', 'age': 56, 'add': 'kathmandu'}}

In [20]:
info[1]['name']

'ramu'

In [23]:
info={}
n=int(input("enter n="))
for i in range(1,n+1):
    name=input("enter name =")
    age=input("enter age =")
    add=input("enter add =")
    d={'name':name,'age':age,'add':add}  
    info[i]=d
info

enter n=3
enter name =fhurifh
enter age =74
enter add =fjvigugh
enter name =hrfjrh
enter age =75
enter add =jfuirh
enter name =jfirhf
enter age =43
enter add =jrfhjrf

{1: {'name': 'fhurifh', 'age': '74', 'add': 'fjvigugh'},
 2: {'name': 'hrfjrh', 'age': '75', 'add': 'jfuirh'},
 3: {'name': 'jfirhf', 'age': '43', 'add': 'jrfhjrf'}}

In [25]:
info[3]={'name':'ram','age':56,'add':'kathmandu'}
info

{1: {'name': 'fhurifh', 'age': '74', 'add': 'fjvigugh'},
 2: {'name': 'hrfjrh', 'age': '75', 'add': 'jfuirh'},
 3: {'name': 'ram', 'age': 56, 'add': 'kathmandu'}}

In [28]:
info[3]['add']={'per':'dhading','temp':'kathmandu'}
info

{1: {'name': 'fhurifh', 'age': '74', 'add': 'fjvigugh'},
 2: {'name': 'hrfjrh', 'age': '75', 'add': 'jfuirh'},
 3: {'name': 'ram', 'age': 56, 'add': {'per': 'dhading', 'temp': 'kathmandu'}}}

In [1]:
#function
#pre defined function
#user defined function

In [2]:
#pre defined function
#print() int() float() str() list() tuple() set() dict()

In [3]:
#def <function name>:
# <operation>

# <function_name>()

In [4]:
def hello():       #defining a function
    print("hello world")
hello()            #calling a function

hello world

In [5]:
def area():
    l=int(input("enter l="))   #local variable
    b=int(input("enter b="))   #local variable
    a=l*b
    print(a)
    
area()

enter l=2
enter b=4
8

In [6]:
def area():
    a=l*b
    print(a)
    
l=int(input("enter l="))   #global variable
b=int(input("enter b="))   #global variable
area()

enter l=3
enter b=5
15

In [7]:
#function with arguments

In [10]:
def area(l,b):  #parameter
    a=l*b
    print(a)
    
area(10,5)  #arguments

50

In [11]:
def area(x,y):
    a=x*y
    print(a)
    
l=int(input("enter l="))   #global variable
b=int(input("enter b="))   #global variable
area(l,b)

enter l=5
enter b=6
30

In [17]:
def info(name,age,add):
    print(f"hello world i am {name}.I am from {add}.I am {age}")
    
name=input("enter name=")
add=input("enter add=")
age=int(input("enter age="))

info(name,age,add)

enter name=subbu
enter add=lubhu
enter age=19
hello world i am subbu.I am from lubhu.I am 19

In [20]:
def info(l):
    x,y,z=l
    print(f"hello world i am {x}.I am from {y}.I am {z}")
    
name=input("enter name=")
add=input("enter add=")
age=int(input("enter age="))

l=[name,age,add]
info(l)

enter name=subbu
enter add=lubhu
enter age=19
hello world i am subbu.I am from 19.I am lubhu

In [21]:
def language(lan="python"):
    print(lan)

language("C")
language("C++")
language("Java")
language("PHP")
language()

C
C++
Java
PHP
python

In [26]:
#return type function
def area():
    l=5
    b=5
    a=l*b
    return a
 #print(area())
ar=area()
h=2
v=ar*h
print("volume=",v)

volume= 50

In [30]:
def cal():
    l=5
    b=5
    h=2
    a=l*b
    v=a*h
    return a,v
 #print(area())
area,volume=cal()
print("area=",area)
print("volume=",volume)

area= 25
volume= 50

In [32]:
#return type function
def cal(l,b,h):
    a=l*b
    v=a*h
    return a,v
 #print(area())
l=int(input("enter l="))
b=int(input("enter b="))
h=int(input("enter h="))

area,volume=cal(l,b,h)
print("area=",area)
print("volume=",volume)

enter l=2
enter b=4
enter h=2
area= 8
volume= 16

In [38]:
def add(a,b):
    return a+b
def sub(a,b):
    return a-b
def mul(a,b):
    return a*b
def div(a,b):
    return a/b

def cal():

    a=int(input("enter a="))
    b=int(input("enter b="))
    o=input("enter +or - or * or/ ")
    if o== "+":
        print(add(a,b))
    elif o== "-":
        print(sub(a,b))
    elif o== "*":
        print(mul(a,b))
    else:
        print(div(a,b))
        
cal()

enter a=2
enter b=2
enter +or - or * or/ +
4

In [1]:
#file handling
#file=open("<file_name>","<mode>")
#file.close()

#with open("<file_name>","<mode>") as file:
#   <operation>

#modes
#create -> 'x'
#read -> 'r'
#write -> 'w'
#append -> 'a'

In [7]:
try:
    file=open('data.txt','x')
    file.close()
except:
    print("the file is already there.")

the file is already there.

In [4]:
pwd

'C:\\Users\\lenovo\\Python-Class Broadway'

In [5]:
file=open('data.txt','r')
data=file.read()
print(data)
file.close()

1.HELLO WORLD
2.HELLO WORLD
3.HELLO WORLD
4.HELLO WORLD
5.HELLO WORLD

In [6]:
print(type(data))

<class 'str'>

In [8]:
data=data.split('\n')
data

['1.HELLO WORLD',
 '2.HELLO WORLD',
 '3.HELLO WORLD',
 '4.HELLO WORLD',
 '5.HELLO WORLD']

In [9]:
print(data[0])

1.HELLO WORLD

In [12]:
#write mode
file=open('data1.txt','w')
file.write('hello world')
file.close()

In [17]:
bill=str()
n=int(input("enter n="))
for i in range(n):
    name=input("enter product name=")
    price=float(input("enter price="))
    qty=float(input("enter quantity="))
    total=price*qty
    bill=bill+f"{name}\t{price}\t{qty}\t{total} \n"
    
file=open('bill.txt','w')
file.write('Name\tPrice\tQuantity\tTotal\n')
file.write(bill)
file.close()

enter n=2
enter product name=apple
enter price=4353
enter quantity=32
enter product name=mango
enter price=2355
enter quantity=23

In [18]:
bill=str()
n=int(input("enter n="))
for i in range(n):
    name=input("enter product name=")
    price=float(input("enter price="))
    qty=float(input("enter quantity="))
    total=price*qty
    bill=bill+f"{name},{price},{qty},{total} \n"
    
file=open('bill.csv','w')
file.write('Name,Price,Quantity,Total\n')
file.write(bill)
file.close()

enter n=2
enter product name=apple
enter price=3456
enter quantity=23
enter product name=strawberry
enter price=4353
enter quantity=43

In [5]:
#using append mode
file=open('bill1.csv','a')
file.write('Name,Price,Quantity,Total\n')

26

In [6]:
bill=str()
n=int(input("enter n="))
for i in range(n):
    name=input("enter product name=")
    price=float(input("enter price="))
    qty=float(input("enter quantity="))
    total=price*qty
    bill=bill+f"{name},{price},{qty},{total} \n"
    

file.write(bill)

enter n=2
enter product name=ghghg
enter price=55
enter quantity=6
enter product name=hgh
enter price=4
enter quantity=5

40

In [7]:
file.close()

In [9]:
import pandas as pd
df=pd.read_csv('bill1.csv')
df

    Name  Price  Quantity   Total
0   Name  Price  Quantity   Total
1  ghghg   55.0       6.0  330.0
2    hgh    4.0       5.0   20.0

In [2]:
try:
    file=open('data.csv','x')
    file.close()
except:
    print("the file is already there!")

the file is already there!

In [4]:
import pandas as pd
df=pd.read_csv('data.csv',nrows=6)
df

   sn   name  age        add       phone
0   1    Ram   34  kathmandu  9863329863
1   2  Shyam   67   lalitpur  9887653672
2   3   Hari   89  bhaktapur  9853652778
3   4   Sita   78     gorkha  9889776656
4   5   Gita   45     butwal    98777656
5   6  Nabin   87     gorkha   974783748

In [11]:
import pandas as pd
df=pd.read_csv('data.csv')
df.head(4)

#df.tail()

   sn   name  age        add       phone
0   1    Ram   34  kathmandu  9863329863
1   2  Shyam   67   lalitpur  9887653672
2   3   Hari   89  bhaktapur  9853652778
3   4   Sita   78     gorkha  9889776656

In [13]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df.head(4)
#df.tail()

     name  age        add       phone
sn
1     Ram   34  kathmandu  9863329863
2   Shyam   67   lalitpur  9887653672
3    Hari   89  bhaktapur  9853652778
4    Sita   78     gorkha  9889776656

In [14]:
df=pd.read_csv('data.csv',usecols=['sn','name','phone'])
df

   sn   name       phone
0   1    Ram  9863329863
1   2  Shyam  9887653672
2   3   Hari  9853652778
3   4   Sita  9889776656
4   5   Gita    98777656
5   6  Nabin   974783748

In [15]:
#iloc
import pandas as pd
df=pd.read_csv('data.csv')
df.iloc[2:5]

   sn  name  age        add       phone
2   3  Hari   89  bhaktapur  9853652778
3   4  Sita   78     gorkha  9889776656
4   5  Gita   45     butwal    98777656

In [16]:
import pandas as pd
df=pd.read_csv('data.csv')
df.iloc[2:5,0:4]

   sn  name  age        add
2   3  Hari   89  bhaktapur
3   4  Sita   78     gorkha
4   5  Gita   45     butwal

In [18]:
#loc
df=pd.read_csv('data.csv',index_col='sn')
df.loc[2:5]

     name  age        add       phone
sn
2   Shyam   67   lalitpur  9887653672
3    Hari   89  bhaktapur  9853652778
4    Sita   78     gorkha  9889776656
5    Gita   45     butwal    98777656

In [22]:
#loc
df=pd.read_csv('data.csv',index_col='name')
df.loc['Hari':'Sita']

      sn  age        add       phone
name
Hari   3   89  bhaktapur  9853652778
Sita   4   78     gorkha  9889776656

In [23]:
#filter
df=pd.read_csv('data.csv')
df['name']

0      Ram
1    Shyam
2     Hari
3     Sita
4     Gita
5    Nabin
Name: name, dtype: object

In [26]:
df['name']=='Ram'

0     True
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [31]:
df[df['age']>=70]

   sn   name  age        add       phone
2   3   Hari   89  bhaktapur  9853652778
3   4   Sita   78     gorkha  9889776656
5   6  Nabin   87     gorkha   974783748

In [34]:
df[(df['age']>=20) & (df['add']=='kathmandu')]

   sn name  age        add       phone
0   1  Ram   34  kathmandu  9863329863

In [2]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='name')
df.loc['Ram':'Gita']

       sn  age        add       phone
name
Ram     1   34  kathmandu  9863329863
Shyam   2   67   lalitpur  9887653672
Hari    3   89  bhaktapur  9853652778
Sita    4   78     gorkha  9889776656
Gita    5   45     butwal    98777656